{
  "backend/main.mo": "Motoko canister handling user profile permissions plus static dispute category definitions with authorization checks.",
  "feature_evidence.json": "Declares evidence for a feature adding a Gauri Jadhav footer credit, linking it to SiteLayout and related components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files including routing, layout, auth, guidance, chatbot, and role pages.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with SiteLayout, ThemeProvider, and Toaster.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache reset.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter their name and save their profile.",
  "frontend/src/components/DisputeCategorySelector.tsx": "UI for selecting a dispute category and fetching associated guidance with result display.",
  "frontend/src/components/DisputeChatbotPanel.tsx": "Empty placeholder file for dispute chatbot panel component.",
  "frontend/src/components/RecentDevelopmentEditorDialog.tsx": "Dialog form to add or edit recent developments with validation and backend mutations.",
  "frontend/src/components/SiteLayout.tsx": "Main layout with header, navigation, auth display, and responsive mobile menu using user profile and identity state.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for fetching, saving user profiles, and checking admin status via the actor.",
  "frontend/src/hooks/useGuidance.ts": "Hooks to fetch dispute categories and request guidance results by category.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, logout, stored identity, and status.",
  "frontend/src/hooks/useRecentDevelopments.ts": "Hooks for retrieving, adding, and editing recent development records.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining theme colors and accessibility rules.",
  "frontend/src/lib/disputeCategories.ts": "Static labels and metadata for dispute categories mapped to backend category types.",
  "frontend/src/main.tsx": "Application entry point initializing React Query and Internet Identity provider around the app.",
  "frontend/src/pages/AboutMediationPage.tsx": "Displays an informational page about mediation in India, covering its definition, evolution, and benefits using cards and styled text.",
  "frontend/src/pages/ComparisonPage.tsx": "Renders a detailed comparison table of dispute resolution methods including mediation, litigation, arbitration, and negotiation.",
  "frontend/src/pages/DisputeGuidancePage.tsx": "Shows a guidance page with a disclaimer and a dispute category selector to help users assess mediation suitability.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero section and role-based navigation cards linking users to tailored mediation information.",
  "frontend/src/pages/MediationProcessPage.tsx": "Provides simple and detailed step-by-step explanations of the mediation process using tabbed content.",
  "frontend/src/pages/RecentDevelopmentsPage.tsx": "Fetches and displays recent mediation-related developments with admin editing capabilities and loading/error states.",
  "frontend/src/pages/roles/CommonPersonPage.tsx": "A page explaining the role, expectations, and rights of parties in mediation, with lists and descriptive sections. Includes guidance on preparation and participation.",
  "frontend/src/pages/roles/JudgePage.tsx": "A page outlining judges’ responsibilities in mediation referrals, key considerations, and benefits of directing cases to mediation.",
  "frontend/src/pages/roles/LawyerPage.tsx": "A page describing lawyers’ advisory role in mediation, their duties, and ethical considerations, along with preparation guidance for clients.",
  "frontend/src/pages/roles/MediatorPage.tsx": "A page detailing mediators’ responsibilities, required skills, and principles of neutrality and impartiality in the mediation process.",
  "frontend/src/pages/roles/StudentPage.tsx": "A page introducing mediation education for students, listing learning opportunities and potential mediation-related career paths.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, storing and retrieving them from sessionStorage, and clearing them from the URL.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and plugins for the frontend build.",
  "project_state.json": "Defines the project’s current state, requirements, architectural notes, and feature list for the mediation website."
}