{
  "backend/main.mo": "Implements user profile storage with authorization checks and exposes static dispute category data and guidance fields.",
  "feature_evidence.json": "Lists feature implementations, associated files, components, tests, and confidence metadata for guidance and UI updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of each frontend file across components, pages, and hooks.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Base HTML file bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with layout, theming, and toaster components.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling login/logout via Internet Identity with reactive status states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting authenticated users without profiles to submit their name and save their profile.",
  "frontend/src/components/DisputeCategorySelector.tsx": "UI component for selecting a dispute category and displaying detailed guidance fetched from backend.",
  "frontend/src/components/DisputeChatbotPanel.tsx": "Empty file placeholder for the removed chatbot component.",
  "frontend/src/components/RecentDevelopmentEditorDialog.tsx": "Dialog form for adding or editing recent developments with validation and backend mutation calls.",
  "frontend/src/components/SiteLayout.tsx": "Layout component with header, navigation, authentication display, and mobile menu, wrapping children content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for fetching and updating the caller’s user profile and checking admin status via the actor.",
  "frontend/src/hooks/useGuidance.ts": "Hooks to fetch dispute categories and request guidance results from the backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, exposing identity state, login, and logout handling.",
  "frontend/src/hooks/useRecentDevelopments.ts": "Hooks for fetching, adding, and editing recent development entries through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, theme styles, and global accessibility and layout rules.",
  "frontend/src/lib/disputeCategories.ts": "Static mapping and list of dispute categories with labels and descriptions.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, and Internet Identity provider.",
  "frontend/src/pages/AboutMediationPage.tsx": "Renders an informational page explaining mediation, its evolution, benefits, and its application in India using cards and structured text.",
  "frontend/src/pages/ComparisonPage.tsx": "Displays a detailed comparison table of mediation, litigation, arbitration, and negotiation with structured data and responsive layouts.",
  "frontend/src/pages/DisputeGuidancePage.tsx": "Provides a guidance intro and disclaimer, then shows a dispute category selector for personalized mediation suitability info.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero content, navigation buttons, and role-based cards linking users to tailored mediation information.",
  "frontend/src/pages/MediationProcessPage.tsx": "Shows simple and detailed mediation process steps with tabbed navigation and descriptive step content.",
  "frontend/src/pages/RecentDevelopmentsPage.tsx": "Fetches and displays mediation-related updates with loading/error states and provides admin editing capabilities through a dialog.",
  "frontend/src/pages/roles/CommonPersonPage.tsx": "Provides guidance for parties in mediation, outlining expectations, rights, and preparation steps using informational cards and lists.",
  "frontend/src/pages/roles/JudgePage.tsx": "Explains judges' role in referring cases to mediation, offering considerations, benefits, and best‑practice guidance.",
  "frontend/src/pages/roles/LawyerPage.tsx": "Describes lawyers' supportive role in mediation, listing duties, ethical obligations, and preparation guidance for clients.",
  "frontend/src/pages/roles/MediatorPage.tsx": "Outlines mediator responsibilities, required skills, and principles like neutrality and impartiality through descriptive sections and lists.",
  "frontend/src/pages/roles/StudentPage.tsx": "Introduces mediation education for students, detailing learning opportunities, career paths, and explanations of mediation roles.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, store, and clear URL or session-based parameters, supporting both query and hash routing. Includes persistence helpers and a hash-parameter removal method.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the website scope, architecture constraints, existing features, and project state versioning for the Mediation Made Simple – India site."
}